Autodesk.Revit.DB.Analysis.VectorAtPoint.#ctor(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ})
Creates object from an array of vectors
vectors:
Array of vectors, each corresponding to "measurement"
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when supplied vectors contain invalid (infinite or non-number) coordinates
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012